{
  "linkedin_url": "https://www.linkedin.com/in/bellmiromar/",
  "name": "Omar Bellmir",
  "location": "Paris, Île-de-France, France",
  "about": null,
  "open_to_work": false,
  "experiences": [
    {
      "position_title": "Strategy and CSR apprentice",
      "institution_name": "IDEMIA · Apprenticeship",
      "linkedin_url": "https://www.linkedin.com/company/3488/",
      "from_date": "Sep 2024",
      "to_date": "Sep 2025",
      "duration": "1 yr 1 mo",
      "location": "Paris, Île-de-France, France · On-site",
      "description": "Analyzed SBTi reduction target of 58.8% for Scopes 1, 2, and 3 through scenario modeling and cost assessment.\nRecommended the optimal reduction pathway based on ROI analysis linked to the Green Cover Bond framework.\nConducted natural disaster risk assessments (floods, heatwaves, water stress) for IDEMIA’s sites, guiding site\nlocation decisions.\nAnalyzed SBTi reduction target of 58.8% for Scopes 1, 2, and 3 through scenario modeling and cost assessment. Recommended the optimal reduction pathway based on ROI analysis linked to the Green Cover Bond framework. Conducted natural disaster risk assessments (floods, heatwaves, water stress) for IDEMIA’s sites, guiding site location decisions.\nSkills: problem modeling · Strategy · Risk Assessment\nSkills: problem modeling · Strategy · Risk Assessment"
    },
    {
      "position_title": "Supply Chain Backhauling Intern",
      "institution_name": "Carrefour · Internship",
      "linkedin_url": "https://www.linkedin.com/company/3046/",
      "from_date": "Feb 2024",
      "to_date": "Jun 2024",
      "duration": "5 mos",
      "location": "Paris, Île-de-France, France · Hybrid",
      "description": "Contributed to a supply chain audit, improving logistics efficiency by 10%.\nAssisted in implementing a backhauling strategy, reducing transportation costs by 2.4%.\nContributed to a supply chain audit, improving logistics efficiency by 10%. Assisted in implementing a backhauling strategy, reducing transportation costs by 2.4%."
    }
  ],
  "educations": [
    {
      "institution_name": "CentraleSupélec",
      "degree": "Master of Engineering - MEng, Engineering",
      "linkedin_url": "https://www.linkedin.com/company/14803/",
      "from_date": "2023",
      "to_date": "2026",
      "description": "Key Topics: Advanced Mathematics, Sustainable Development, Supply Chain Management, Artificial Intelligence, Data Science, Philosophy, Mergers and Acquisitions, Corporate Strategy, Due Diligence\nKey Topics: Advanced Mathematics, Sustainable Development, Supply Chain Management, Artificial Intelligence, Data Science, Philosophy, Mergers and Acquisitions, Corporate Strategy, Due Diligence"
    },
    {
      "institution_name": "University of Paris I: Panthéon-Sorbonne",
      "degree": "Master's degree, Innovation, Technology Management & Sustainable Development",
      "linkedin_url": "https://www.linkedin.com/company/15094912/",
      "from_date": "Sep 2024",
      "to_date": "Sep 2025",
      "description": "Ranked 4th in its field in France\nRelevant Courses: Risk Management, Project Management, Circular Economy, Environmental Economics, Law, Market & Business Intelligence\nRanked 4th in its field in France Relevant Courses: Risk Management, Project Management, Circular Economy, Environmental Economics, Law, Market & Business Intelligence"
    },
    {
      "institution_name": "Ecole Centrale Casablanca",
      "degree": "Engineering degree",
      "linkedin_url": "https://www.linkedin.com/company/3747130/",
      "from_date": "Sep 2022",
      "to_date": "2026",
      "description": "Ecole Centrale Casablanca stands as Morocco's pioneering generalist engineering school, affiliated with the international Écoles Centrale network renowned for its innovative teaching techniques aimed at producing highly skilled engineers with a broad spectrum of knowledge and a strong global outlook.\n\nThe engineer diploma granted by Ecole Centrale Casablanca enjoys formal recognition by the French government, a recognition cemented through accreditation from the CTI.\n\nFocus: AI, Corporate Finance, Linear Models, Statistics, Advanced Mathematics, Project Management, Machine Learning, General Economics, Sociology\nEcole Centrale Casablanca stands as Morocco's pioneering generalist engineering school, affiliated with the international Écoles Centrale network renowned for its innovative teaching techniques aimed at producing highly skilled engineers with a broad spectrum of knowledge and a strong global outlook. The engineer diploma granted by Ecole Centrale Casablanca enjoys formal recognition by the French government, a recognition cemented through accreditation from the CTI. Focus: AI, Corporate Finance, Linear Models, Statistics, Advanced Mathematics, Project Management, Machine Learning, General Economics, Sociology\nSkills: Critical Thinking · Project Planning · Project Management\nSkills: Critical Thinking · Project Planning · Project Management"
    },
    {
      "institution_name": "CPGE - Classes préparatoires aux grandes écoles",
      "degree": "BAC+2, MPSI/MP",
      "linkedin_url": "https://www.linkedin.com/company/34681533/",
      "from_date": "Sep 2020",
      "to_date": "Sep 2022",
      "description": null
    }
  ],
  "interests": [],
  "accomplishments": [],
  "contacts": []
}